{
  "id": "urn:ngsi-ld:SystemSeparationInfo:id:OEYU:04558809",
  "dateCreated": "1971-06-11T11:02:58Z",
  "dateModified": "1981-04-17T22:16:45Z",
  "source": "Quickly final probably box society with. View woman main analysis. Think region why best with.",
  "name": "Treat inside expect figure. Animal ago television visit late.",
  "alternateName": "Under feel opportunity next win",
  "description": "Notice customer speak employee spend lose. Role middle teach important order section task outside. Center resource contro",
  "dataProvider": "Drive read poor policy. Try quality report safe. Yard reason continue wide.",
  "owner": [
    "urn:ngsi-ld:SystemSeparationInfo:items:ADKU:62722895",
    "urn:ngsi-ld:SystemSeparationInfo:items:TSIM:96224949"
  ],
  "seeAlso": [
    "urn:ngsi-ld:SystemSeparationInfo:items:GQMR:39834804"
  ],
  "location": {
    "type": "Point",
    "coordinates": [
      37.1257535,
      35.88905
    ]
  },
  "address": {
    "streetAddress": "Rate matter lawyer kitchen late since opportunity sou",
    "addressLocality": "Two tell buy opportunity particular pass. Military food together peace successfu",
    "addressRegion": "Always mission where respond campaign military. Key town democratic trade control. Reach myself staff week",
    "addressCountry": "Prove quite trouble call throughout specific force. Cut gas short explain hospital note.",
    "postalCode": "Yet position eye manager might chair. Window rich blue media stop expect view care. Floor although light its.",
    "postOfficeBoxNumber": "Miss word baby put think what. Political everybody than put world discu",
    "streetNr": "Town main career staff why ahead process. Woman seat PM never good. Cut at w",
    "district": "Forget memory specific own fast p"
  },
  "areaServed": "Understand him visit certain task. Bar staff use but.",
  "type": "SystemSeparationInfo",
  "systemSeparationInfoChangeSupplySystem": "Bed class laugh idea improve garden goal. Skin possible perhaps board. Letter short agent class. Trial role guess.",
  "systemSeparationInfoLength": 864,
  "systemSeparationInfoPantographLowered": false,
  "systemSeparationInfoSwitchOffBreaker": false,
  "context": [
    "https://raw.githubusercontent.com/smart-data-models/dataModel.ERA/master/context.jsonld"
  ]
}