{"Media": {"description": "A photo, video, or audio recording acquired or used in healthcare. The actual content may be inline or provided by direct reference.", "properties": {"resourceType": {"description": "This is a Media resource", "const": "Media"}, "id": {"description": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.", "$ref": "#/definitions/string"}, "meta": {"description": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content might not always be associated with version changes to the resource.", "$ref": "#/definitions/Meta"}, "implicitRules": {"description": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Often, this is a reference to an implementation guide that defines the special rules along with other profiles etc.", "$ref": "#/definitions/uri"}, "_implicitRules": {"description": "Extensions for implicitRules", "$ref": "#/definitions/Element"}, "language": {"description": "The base language in which the resource is written.", "$ref": "#/definitions/code"}, "_language": {"description": "Extensions for language", "$ref": "#/definitions/Element"}, "text": {"description": "A human-readable narrative that contains a summary of the resource and can be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.", "$ref": "#/definitions/Narrative"}, "contained": {"description": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.", "items": {"$ref": "#/definitions/ResourceList"}, "type": "array"}, "extension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "modifierExtension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource and that modifies the understanding of the element that contains it and/or the understanding of the containing element's descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "identifier": {"description": "Identifiers associated with the image - these may include identifiers for the image itself, identifiers for the context of its collection (e.g. series ids) and context ids such as accession numbers or other workflow identifiers.", "items": {"$ref": "#/definitions/Identifier"}, "type": "array"}, "basedOn": {"description": "A procedure that is fulfilled in whole or in part by the creation of this media.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "partOf": {"description": "A larger event of which this particular event is a component or step.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "status": {"description": "The current state of the {{title}}.", "$ref": "#/definitions/code"}, "_status": {"description": "Extensions for status", "$ref": "#/definitions/Element"}, "type": {"description": "A code that classifies whether the media is an image, video or audio recording or some other media category.", "$ref": "#/definitions/CodeableConcept"}, "modality": {"description": "Details of the type of the media - usually, how it was acquired (what type of device). If images sourced from a DICOM system, are wrapped in a Media resource, then this is the modality.", "$ref": "#/definitions/CodeableConcept"}, "view": {"description": "The name of the imaging view e.g. Lateral or Antero-posterior (AP).", "$ref": "#/definitions/CodeableConcept"}, "subject": {"description": "Who/What this Media is a record of.", "$ref": "#/definitions/Reference"}, "encounter": {"description": "The encounter that establishes the context for this media.", "$ref": "#/definitions/Reference"}, "createdDateTime": {"description": "The date and time(s) at which the media was collected.", "pattern": "^([0-9]([0-9]([0-9][1-9]|[1-9]0)|[1-9]00)|[1-9]000)(-(0[1-9]|1[0-2])(-(0[1-9]|[1-2][0-9]|3[0-1])(T([01][0-9]|2[0-3]):[0-5][0-9]:([0-5][0-9]|60)(\\.[0-9]+)?(Z|(\\+|-)((0[0-9]|1[0-3]):[0-5][0-9]|14:00)))?)?)?$", "type": "string"}, "_createdDateTime": {"description": "Extensions for createdDateTime", "$ref": "#/definitions/Element"}, "createdPeriod": {"description": "The date and time(s) at which the media was collected.", "$ref": "#/definitions/Period"}, "issued": {"description": "The date and time this version of the media was made available to providers, typically after having been reviewed.", "$ref": "#/definitions/instant"}, "_issued": {"description": "Extensions for issued", "$ref": "#/definitions/Element"}, "operator": {"description": "The person who administered the collection of the image.", "$ref": "#/definitions/Reference"}, "reasonCode": {"description": "Describes why the event occurred in coded or textual form.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "bodySite": {"description": "Indicates the site on the subject's body where the observation was made (i.e. the target site).", "$ref": "#/definitions/CodeableConcept"}, "deviceName": {"description": "The name of the device / manufacturer of the device  that was used to make the recording.", "$ref": "#/definitions/string"}, "_deviceName": {"description": "Extensions for deviceName", "$ref": "#/definitions/Element"}, "device": {"description": "The device used to collect the media.", "$ref": "#/definitions/Reference"}, "height": {"description": "Height of the image in pixels (photo/video).", "$ref": "#/definitions/positiveInt"}, "_height": {"description": "Extensions for height", "$ref": "#/definitions/Element"}, "width": {"description": "Width of the image in pixels (photo/video).", "$ref": "#/definitions/positiveInt"}, "_width": {"description": "Extensions for width", "$ref": "#/definitions/Element"}, "frames": {"description": "The number of frames in a photo. This is used with a multi-page fax, or an imaging acquisition context that takes multiple slices in a single image, or an animated gif. If there is more than one frame, this SHALL have a value in order to alert interface software that a multi-frame capable rendering widget is required.", "$ref": "#/definitions/positiveInt"}, "_frames": {"description": "Extensions for frames", "$ref": "#/definitions/Element"}, "duration": {"description": "The duration of the recording in seconds - for audio and video.", "$ref": "#/definitions/decimal"}, "_duration": {"description": "Extensions for duration", "$ref": "#/definitions/Element"}, "content": {"description": "The actual content of the media - inline or by direct reference to the media source file.", "$ref": "#/definitions/Attachment"}, "note": {"description": "Comments made about the media by the performer, subject or other participants.", "items": {"$ref": "#/definitions/Annotation"}, "type": "array"}}, "additionalProperties": false, "required": ["content", "resourceType"]}}