{"AllergyIntolerance": {"description": "Risk of harmful or undesirable, physiological response which is unique to an individual and associated with exposure to a substance.", "properties": {"resourceType": {"description": "This is a AllergyIntolerance resource", "const": "AllergyIntolerance"}, "id": {"description": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.", "$ref": "#/definitions/string"}, "meta": {"description": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content might not always be associated with version changes to the resource.", "$ref": "#/definitions/Meta"}, "implicitRules": {"description": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Often, this is a reference to an implementation guide that defines the special rules along with other profiles etc.", "$ref": "#/definitions/uri"}, "_implicitRules": {"description": "Extensions for implicitRules", "$ref": "#/definitions/Element"}, "language": {"description": "The base language in which the resource is written.", "$ref": "#/definitions/code"}, "_language": {"description": "Extensions for language", "$ref": "#/definitions/Element"}, "text": {"description": "A human-readable narrative that contains a summary of the resource and can be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.", "$ref": "#/definitions/Narrative"}, "contained": {"description": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.", "items": {"$ref": "#/definitions/ResourceList"}, "type": "array"}, "extension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "modifierExtension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource and that modifies the understanding of the element that contains it and/or the understanding of the containing element's descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "identifier": {"description": "Business identifiers assigned to this AllergyIntolerance by the performer or other systems which remain constant as the resource is updated and propagates from server to server.", "items": {"$ref": "#/definitions/Identifier"}, "type": "array"}, "clinicalStatus": {"description": "The clinical status of the allergy or intolerance.", "$ref": "#/definitions/CodeableConcept"}, "verificationStatus": {"description": "Assertion about certainty associated with the propensity, or potential risk, of a reaction to the identified substance (including pharmaceutical product).", "$ref": "#/definitions/CodeableConcept"}, "type": {"description": "Identification of the underlying physiological mechanism for the reaction risk.", "$ref": "#/definitions/code"}, "_type": {"description": "Extensions for type", "$ref": "#/definitions/Element"}, "category": {"description": "Category of the identified substance.", "items": {"$ref": "#/definitions/code"}, "type": "array"}, "_category": {"description": "Extensions for category", "items": {"$ref": "#/definitions/Element"}, "type": "array"}, "criticality": {"description": "Estimate of the potential clinical harm, or seriousness, of the reaction to the identified substance.", "$ref": "#/definitions/code"}, "_criticality": {"description": "Extensions for criticality", "$ref": "#/definitions/Element"}, "code": {"description": "Code for an allergy or intolerance statement (either a positive or a negated/excluded statement).  This may be a code for a substance or pharmaceutical product that is considered to be responsible for the adverse reaction risk (e.g., \"Latex\"), an allergy or intolerance condition (e.g., \"Latex allergy\"), or a negated/excluded code for a specific substance or class (e.g., \"No latex allergy\") or a general or categorical negated statement (e.g.,  \"No known allergy\", \"No known drug allergies\").  Note: the substance for a specific reaction may be different from the substance identified as the cause of the risk, but it must be consistent with it. For instance, it may be a more specific substance (e.g. a brand medication) or a composite product that includes the identified substance. It must be clinically safe to only process the 'code' and ignore the 'reaction.substance'.  If a receiving system is unable to confirm that AllergyIntolerance.reaction.substance falls within the semantic scope of AllergyIntolerance.code, then the receiving system should ignore AllergyIntolerance.reaction.substance.", "$ref": "#/definitions/CodeableConcept"}, "patient": {"description": "The patient who has the allergy or intolerance.", "$ref": "#/definitions/Reference"}, "encounter": {"description": "The encounter when the allergy or intolerance was asserted.", "$ref": "#/definitions/Reference"}, "onsetDateTime": {"description": "Estimated or actual date,  date-time, or age when allergy or intolerance was identified.", "pattern": "^([0-9]([0-9]([0-9][1-9]|[1-9]0)|[1-9]00)|[1-9]000)(-(0[1-9]|1[0-2])(-(0[1-9]|[1-2][0-9]|3[0-1])(T([01][0-9]|2[0-3]):[0-5][0-9]:([0-5][0-9]|60)(\\.[0-9]+)?(Z|(\\+|-)((0[0-9]|1[0-3]):[0-5][0-9]|14:00)))?)?)?$", "type": "string"}, "_onsetDateTime": {"description": "Extensions for onsetDateTime", "$ref": "#/definitions/Element"}, "onsetAge": {"description": "Estimated or actual date,  date-time, or age when allergy or intolerance was identified.", "$ref": "#/definitions/Age"}, "onsetPeriod": {"description": "Estimated or actual date,  date-time, or age when allergy or intolerance was identified.", "$ref": "#/definitions/Period"}, "onsetRange": {"description": "Estimated or actual date,  date-time, or age when allergy or intolerance was identified.", "$ref": "#/definitions/Range"}, "onsetString": {"description": "Estimated or actual date,  date-time, or age when allergy or intolerance was identified.", "pattern": "^[ \\r\\n\\t\\S]+$", "type": "string"}, "_onsetString": {"description": "Extensions for onsetString", "$ref": "#/definitions/Element"}, "recordedDate": {"description": "The recordedDate represents when this particular AllergyIntolerance record was created in the system, which is often a system-generated date.", "$ref": "#/definitions/dateTime"}, "_recordedDate": {"description": "Extensions for recordedDate", "$ref": "#/definitions/Element"}, "recorder": {"description": "Individual who recorded the record and takes responsibility for its content.", "$ref": "#/definitions/Reference"}, "asserter": {"description": "The source of the information about the allergy that is recorded.", "$ref": "#/definitions/Reference"}, "lastOccurrence": {"description": "Represents the date and/or time of the last known occurrence of a reaction event.", "$ref": "#/definitions/dateTime"}, "_lastOccurrence": {"description": "Extensions for lastOccurrence", "$ref": "#/definitions/Element"}, "note": {"description": "Additional narrative about the propensity for the Adverse Reaction, not captured in other fields.", "items": {"$ref": "#/definitions/Annotation"}, "type": "array"}, "reaction": {"description": "Details about each adverse reaction event linked to exposure to the identified substance.", "items": {"$ref": "#/definitions/AllergyIntolerance_Reaction"}, "type": "array"}}, "additionalProperties": false, "required": ["patient", "resourceType"]}}