{"CarePlan": {"description": "Describes the intention of how one or more practitioners intend to deliver care for a particular patient, group or community for a period of time, possibly limited to care for a specific condition or set of conditions.", "properties": {"resourceType": {"description": "This is a CarePlan resource", "const": "CarePlan"}, "id": {"description": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.", "$ref": "#/definitions/string"}, "meta": {"description": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content might not always be associated with version changes to the resource.", "$ref": "#/definitions/Meta"}, "implicitRules": {"description": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Often, this is a reference to an implementation guide that defines the special rules along with other profiles etc.", "$ref": "#/definitions/uri"}, "_implicitRules": {"description": "Extensions for implicitRules", "$ref": "#/definitions/Element"}, "language": {"description": "The base language in which the resource is written.", "$ref": "#/definitions/code"}, "_language": {"description": "Extensions for language", "$ref": "#/definitions/Element"}, "text": {"description": "A human-readable narrative that contains a summary of the resource and can be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.", "$ref": "#/definitions/Narrative"}, "contained": {"description": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.", "items": {"$ref": "#/definitions/ResourceList"}, "type": "array"}, "extension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "modifierExtension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource and that modifies the understanding of the element that contains it and/or the understanding of the containing element's descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "identifier": {"description": "Business identifiers assigned to this care plan by the performer or other systems which remain constant as the resource is updated and propagates from server to server.", "items": {"$ref": "#/definitions/Identifier"}, "type": "array"}, "instantiatesCanonical": {"description": "The URL pointing to a FHIR-defined protocol, guideline, questionnaire or other definition that is adhered to in whole or in part by this CarePlan.", "items": {"$ref": "#/definitions/canonical"}, "type": "array"}, "instantiatesUri": {"description": "The URL pointing to an externally maintained protocol, guideline, questionnaire or other definition that is adhered to in whole or in part by this CarePlan.", "items": {"$ref": "#/definitions/uri"}, "type": "array"}, "_instantiatesUri": {"description": "Extensions for instantiatesUri", "items": {"$ref": "#/definitions/Element"}, "type": "array"}, "basedOn": {"description": "A care plan that is fulfilled in whole or in part by this care plan.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "replaces": {"description": "Completed or terminated care plan whose function is taken by this new care plan.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "partOf": {"description": "A larger care plan of which this particular care plan is a component or step.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "status": {"description": "Indicates whether the plan is currently being acted upon, represents future intentions or is now a historical record.", "$ref": "#/definitions/code"}, "_status": {"description": "Extensions for status", "$ref": "#/definitions/Element"}, "intent": {"description": "Indicates the level of authority/intentionality associated with the care plan and where the care plan fits into the workflow chain.", "$ref": "#/definitions/code"}, "_intent": {"description": "Extensions for intent", "$ref": "#/definitions/Element"}, "category": {"description": "Identifies what \"kind\" of plan this is to support differentiation between multiple co-existing plans; e.g. \"Home health\", \"psychiatric\", \"asthma\", \"disease management\", \"wellness plan\", etc.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "title": {"description": "Human-friendly name for the care plan.", "$ref": "#/definitions/string"}, "_title": {"description": "Extensions for title", "$ref": "#/definitions/Element"}, "description": {"description": "A description of the scope and nature of the plan.", "$ref": "#/definitions/string"}, "_description": {"description": "Extensions for description", "$ref": "#/definitions/Element"}, "subject": {"description": "Identifies the patient or group whose intended care is described by the plan.", "$ref": "#/definitions/Reference"}, "encounter": {"description": "The Encounter during which this CarePlan was created or to which the creation of this record is tightly associated.", "$ref": "#/definitions/Reference"}, "period": {"description": "Indicates when the plan did (or is intended to) come into effect and end.", "$ref": "#/definitions/Period"}, "created": {"description": "Represents when this particular CarePlan record was created in the system, which is often a system-generated date.", "$ref": "#/definitions/dateTime"}, "_created": {"description": "Extensions for created", "$ref": "#/definitions/Element"}, "author": {"description": "When populated, the author is responsible for the care plan.  The care plan is attributed to the author.", "$ref": "#/definitions/Reference"}, "contributor": {"description": "Identifies the individual(s) or organization who provided the contents of the care plan.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "careTeam": {"description": "Identifies all people and organizations who are expected to be involved in the care envisioned by this plan.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "addresses": {"description": "Identifies the conditions/problems/concerns/diagnoses/etc. whose management and/or mitigation are handled by this plan.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "supportingInfo": {"description": "Identifies portions of the patient's record that specifically influenced the formation of the plan.  These might include comorbidities, recent procedures, limitations, recent assessments, etc.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "goal": {"description": "Describes the intended objective(s) of carrying out the care plan.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "activity": {"description": "Identifies a planned action to occur as part of the plan.  For example, a medication to be used, lab tests to perform, self-monitoring, education, etc.", "items": {"$ref": "#/definitions/CarePlan_Activity"}, "type": "array"}, "note": {"description": "General notes about the care plan not covered elsewhere.", "items": {"$ref": "#/definitions/Annotation"}, "type": "array"}}, "additionalProperties": false, "required": ["subject", "resourceType"]}}