{"Specimen": {"description": "A sample to be used for analysis.", "properties": {"resourceType": {"description": "This is a Specimen resource", "const": "Specimen"}, "id": {"description": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.", "$ref": "#/definitions/string"}, "meta": {"description": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content might not always be associated with version changes to the resource.", "$ref": "#/definitions/Meta"}, "implicitRules": {"description": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Often, this is a reference to an implementation guide that defines the special rules along with other profiles etc.", "$ref": "#/definitions/uri"}, "_implicitRules": {"description": "Extensions for implicitRules", "$ref": "#/definitions/Element"}, "language": {"description": "The base language in which the resource is written.", "$ref": "#/definitions/code"}, "_language": {"description": "Extensions for language", "$ref": "#/definitions/Element"}, "text": {"description": "A human-readable narrative that contains a summary of the resource and can be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.", "$ref": "#/definitions/Narrative"}, "contained": {"description": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.", "items": {"$ref": "#/definitions/ResourceList"}, "type": "array"}, "extension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "modifierExtension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource and that modifies the understanding of the element that contains it and/or the understanding of the containing element's descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "identifier": {"description": "Id for specimen.", "items": {"$ref": "#/definitions/Identifier"}, "type": "array"}, "accessionIdentifier": {"description": "The identifier assigned by the lab when accessioning specimen(s). This is not necessarily the same as the specimen identifier, depending on local lab procedures.", "$ref": "#/definitions/Identifier"}, "status": {"description": "The availability of the specimen.", "$ref": "#/definitions/code"}, "_status": {"description": "Extensions for status", "$ref": "#/definitions/Element"}, "type": {"description": "The kind of material that forms the specimen.", "$ref": "#/definitions/CodeableConcept"}, "subject": {"description": "Where the specimen came from. This may be from patient(s), from a location (e.g., the source of an environmental sample), or a sampling of a substance or a device.", "$ref": "#/definitions/Reference"}, "receivedTime": {"description": "Time when specimen was received for processing or testing.", "$ref": "#/definitions/dateTime"}, "_receivedTime": {"description": "Extensions for receivedTime", "$ref": "#/definitions/Element"}, "parent": {"description": "Reference to the parent (source) specimen which is used when the specimen was either derived from or a component of another specimen.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "request": {"description": "Details concerning a service request that required a specimen to be collected.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "collection": {"description": "Details concerning the specimen collection.", "$ref": "#/definitions/Specimen_Collection"}, "processing": {"description": "Details concerning processing and processing steps for the specimen.", "items": {"$ref": "#/definitions/Specimen_Processing"}, "type": "array"}, "container": {"description": "The container holding the specimen.  The recursive nature of containers; i.e. blood in tube in tray in rack is not addressed here.", "items": {"$ref": "#/definitions/Specimen_Container"}, "type": "array"}, "condition": {"description": "A mode or state of being that describes the nature of the specimen.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "note": {"description": "To communicate any details or issues about the specimen or during the specimen collection. (for example: broken vial, sent with patient, frozen).", "items": {"$ref": "#/definitions/Annotation"}, "type": "array"}}, "additionalProperties": false, "required": ["resourceType"]}}