{
  "id": "urn:ngsi-ld:Certificate:id:OEMR:38840161",
  "dateCreated": "2000-01-17T20:24:29Z",
  "dateModified": "2014-02-03T22:13:34Z",
  "source": "Strategy there certainly federal. Risk manager carry shoulder only long.",
  "name": "Across him eight property help. Beat federal dream conference score special deal accept.",
  "alternateName": "Heart beat fine nice identify. Wide usually me in painting tough entire.",
  "description": "Section employee few. Decision prevent easy.",
  "dataProvider": "Talk necessary run score recent. Expert seem money concern shoulder goal. Recognize camera state want across mind his.",
  "owner": [
    "urn:ngsi-ld:Certificate:items:ZTPB:96026524",
    "urn:ngsi-ld:Certificate:items:MZYH:89260401"
  ],
  "seeAlso": [
    "urn:ngsi-ld:Certificate:items:LMJQ:88266844"
  ],
  "location": {
    "type": "Point",
    "coordinates": [
      -52.637063,
      23.558812
    ]
  },
  "address": {
    "streetAddress": "Modern society station campaign. Important through to discover guess. Someone consider entire li",
    "addressLocality": "Firm art goal mind as include. Visit memory leg care probably because commercial how.",
    "addressRegion": "Success right poor each near foot. At without shake main current strategy. Stand along stuff keep coach tow",
    "addressCountry": "Wrong fall write onto forget. Air hard quality. Rise try blue either s",
    "postalCode": "Point structure evening policy here. Use talk pressure democratic want.",
    "postOfficeBoxNumber": "Cell board else course always recent. Property almost serve before.",
    "streetNr": "Special shake soldier bed include. Thus doctor political blue even girl.",
    "district": "Accept west participant suggest whatever feel later. Rule deep owner."
  },
  "areaServed": "Allow whole live analysis defense million strategy real. Bed chance different attention community protect. Government thus build ",
  "type": "Certificate",
  "state": "urn:ngsi-ld:Certificate:state:KHMM:25466110"
}