{"DetectedIssue": {"description": "Indicates an actual or potential clinical issue with or between one or more active or proposed clinical actions for a patient; e.g. Drug-drug interaction, Ineffective treatment frequency, Procedure-condition conflict, etc.", "properties": {"resourceType": {"description": "This is a DetectedIssue resource", "const": "DetectedIssue"}, "id": {"description": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.", "$ref": "#/definitions/string"}, "meta": {"description": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content might not always be associated with version changes to the resource.", "$ref": "#/definitions/Meta"}, "implicitRules": {"description": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Often, this is a reference to an implementation guide that defines the special rules along with other profiles etc.", "$ref": "#/definitions/uri"}, "_implicitRules": {"description": "Extensions for implicitRules", "$ref": "#/definitions/Element"}, "language": {"description": "The base language in which the resource is written.", "$ref": "#/definitions/code"}, "_language": {"description": "Extensions for language", "$ref": "#/definitions/Element"}, "text": {"description": "A human-readable narrative that contains a summary of the resource and can be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.", "$ref": "#/definitions/Narrative"}, "contained": {"description": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.", "items": {"$ref": "#/definitions/ResourceList"}, "type": "array"}, "extension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "modifierExtension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource and that modifies the understanding of the element that contains it and/or the understanding of the containing element's descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "identifier": {"description": "Business identifier associated with the detected issue record.", "items": {"$ref": "#/definitions/Identifier"}, "type": "array"}, "status": {"description": "Indicates the status of the detected issue.", "$ref": "#/definitions/code"}, "_status": {"description": "Extensions for status", "$ref": "#/definitions/Element"}, "code": {"description": "Identifies the general type of issue identified.", "$ref": "#/definitions/CodeableConcept"}, "severity": {"description": "Indicates the degree of importance associated with the identified issue based on the potential impact on the patient.", "$ref": "#/definitions/code"}, "_severity": {"description": "Extensions for severity", "$ref": "#/definitions/Element"}, "patient": {"description": "Indicates the patient whose record the detected issue is associated with.", "$ref": "#/definitions/Reference"}, "identifiedDateTime": {"description": "The date or period when the detected issue was initially identified.", "pattern": "^([0-9]([0-9]([0-9][1-9]|[1-9]0)|[1-9]00)|[1-9]000)(-(0[1-9]|1[0-2])(-(0[1-9]|[1-2][0-9]|3[0-1])(T([01][0-9]|2[0-3]):[0-5][0-9]:([0-5][0-9]|60)(\\.[0-9]+)?(Z|(\\+|-)((0[0-9]|1[0-3]):[0-5][0-9]|14:00)))?)?)?$", "type": "string"}, "_identifiedDateTime": {"description": "Extensions for identifiedDateTime", "$ref": "#/definitions/Element"}, "identifiedPeriod": {"description": "The date or period when the detected issue was initially identified.", "$ref": "#/definitions/Period"}, "author": {"description": "Individual or device responsible for the issue being raised.  For example, a decision support application or a pharmacist conducting a medication review.", "$ref": "#/definitions/Reference"}, "implicated": {"description": "Indicates the resource representing the current activity or proposed activity that is potentially problematic.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "evidence": {"description": "Supporting evidence or manifestations that provide the basis for identifying the detected issue such as a GuidanceResponse or MeasureReport.", "items": {"$ref": "#/definitions/DetectedIssue_Evidence"}, "type": "array"}, "detail": {"description": "A textual explanation of the detected issue.", "$ref": "#/definitions/string"}, "_detail": {"description": "Extensions for detail", "$ref": "#/definitions/Element"}, "reference": {"description": "The literature, knowledge-base or similar reference that describes the propensity for the detected issue identified.", "$ref": "#/definitions/uri"}, "_reference": {"description": "Extensions for reference", "$ref": "#/definitions/Element"}, "mitigation": {"description": "Indicates an action that has been taken or is committed to reduce or eliminate the likelihood of the risk identified by the detected issue from manifesting.  Can also reflect an observation of known mitigating factors that may reduce/eliminate the need for any action.", "items": {"$ref": "#/definitions/DetectedIssue_Mitigation"}, "type": "array"}}, "additionalProperties": false, "required": ["resourceType"]}}