{"RegulatedAuthorization": {"description": "Regulatory approval, clearance or licencing related to a regulated product, treatment, facility or activity that is cited in a guidance, regulation, rule or legislative act. An example is Market Authorization relating to a Medicinal Product.", "properties": {"resourceType": {"description": "This is a RegulatedAuthorization resource", "const": "RegulatedAuthorization"}, "id": {"description": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.", "$ref": "#/definitions/string"}, "meta": {"description": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content might not always be associated with version changes to the resource.", "$ref": "#/definitions/Meta"}, "implicitRules": {"description": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Often, this is a reference to an implementation guide that defines the special rules along with other profiles etc.", "$ref": "#/definitions/uri"}, "_implicitRules": {"description": "Extensions for implicitRules", "$ref": "#/definitions/Element"}, "language": {"description": "The base language in which the resource is written.", "$ref": "#/definitions/code"}, "_language": {"description": "Extensions for language", "$ref": "#/definitions/Element"}, "text": {"description": "A human-readable narrative that contains a summary of the resource and can be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.", "$ref": "#/definitions/Narrative"}, "contained": {"description": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.", "items": {"$ref": "#/definitions/ResourceList"}, "type": "array"}, "extension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "modifierExtension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource and that modifies the understanding of the element that contains it and/or the understanding of the containing element's descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "identifier": {"description": "Business identifier for the authorization, typically assigned by the authorizing body.", "items": {"$ref": "#/definitions/Identifier"}, "type": "array"}, "subject": {"description": "The product type, treatment, facility or activity that is being authorized.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "type": {"description": "Overall type of this authorization, for example drug marketing approval, orphan drug designation.", "$ref": "#/definitions/CodeableConcept"}, "description": {"description": "General textual supporting information.", "$ref": "#/definitions/markdown"}, "_description": {"description": "Extensions for description", "$ref": "#/definitions/Element"}, "region": {"description": "The territory (e.g., country, jurisdiction etc.) in which the authorization has been granted.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "status": {"description": "The status that is authorised e.g. approved. Intermediate states and actions can be tracked with cases and applications.", "$ref": "#/definitions/CodeableConcept"}, "statusDate": {"description": "The date at which the current status was assigned.", "$ref": "#/definitions/dateTime"}, "_statusDate": {"description": "Extensions for statusDate", "$ref": "#/definitions/Element"}, "validityPeriod": {"description": "The time period in which the regulatory approval, clearance or licencing is in effect. As an example, a Marketing Authorization includes the date of authorization and/or an expiration date.", "$ref": "#/definitions/Period"}, "indication": {"description": "Condition for which the use of the regulated product applies.", "$ref": "#/definitions/CodeableReference"}, "intendedUse": {"description": "The intended use of the product, e.g. prevention, treatment, diagnosis.", "$ref": "#/definitions/CodeableConcept"}, "basis": {"description": "The legal or regulatory framework against which this authorization is granted, or other reasons for it.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "holder": {"description": "The organization that has been granted this authorization, by some authoritative body (the 'regulator').", "$ref": "#/definitions/Reference"}, "regulator": {"description": "The regulatory authority or authorizing body granting the authorization. For example, European Medicines Agency (EMA), Food and Drug Administration (FDA), Health Canada (HC), etc.", "$ref": "#/definitions/Reference"}, "case": {"description": "The case or regulatory procedure for granting or amending a regulated authorization. An authorization is granted in response to submissions/applications by those seeking authorization. A case is the administrative process that deals with the application(s) that relate to this and assesses them. Note: This area is subject to ongoing review and the workgroup is seeking implementer feedback on its use (see link at bottom of page).", "$ref": "#/definitions/RegulatedAuthorization_Case"}}, "additionalProperties": false, "required": ["resourceType"]}}