{
  "id": "urn:ngsi-ld:FrenchTrainDetectionSystemLimitation:id:PSSH:36864867",
  "dateCreated": "2014-09-23T15:45:27Z",
  "dateModified": "1995-12-08T08:26:38Z",
  "source": "Including since ",
  "name": "Happy partner share space rock know wait. Easy something result inside strategy approach. Hold book dream agreement loss site sure.",
  "alternateName": "Effort actually scientist window act green modern. Picture read theory deep set minute even. Beautiful machine reduce truth television design time scientist",
  "description": "Person opportunity very kitchen phone similar. Service service find strategy. Wall to ready institution support meeting military.",
  "dataProvider": "Computer hotel federal kid it perhaps. Source within international senior stop final around. Evidence music science.",
  "owner": [
    "urn:ngsi-ld:FrenchTrainDetectionSystemLimitation:items:ZDER:64486064",
    "urn:ngsi-ld:FrenchTrainDetectionSystemLimitation:items:EWOX:19497229"
  ],
  "seeAlso": [
    "urn:ngsi-ld:FrenchTrainDetectionSystemLimitation:items:BOEA:61450089"
  ],
  "location": {
    "type": "Point",
    "coordinates": [
      -21.934426,
      6.101443
    ]
  },
  "address": {
    "streetAddress": "Wonder majority ability. Forget throughout discussion cost. Dream store case number.",
    "addressLocality": "Turn which sometimes. Environmental middle popular series. Stock cold hundred street read she maintain.",
    "addressRegion": "Lot watch matter. Item station",
    "addressCountry": "Religious none pretty defense. End out without then party. Stock million difficult resource million bring name bill.",
    "postalCode": "Enjoy fear task company run. Left play marriage type someone ok. Away require city worker.",
    "postOfficeBoxNumber": "Near bed always benefit fine popular economic. Ever material save after scientist.",
    "streetNr": "Read much station loss door room cold entire. Various agree whether above ago where. Knowledge risk article degree spend drive. Science most question meet visit",
    "district": "Open administration space ahead. Soci"
  },
  "areaServed": "Including international kind animal customer. Identify large me. Field deal ",
  "type": "FrenchTrainDetectionSystemLimitation",
  "frenchTrainDetectionSystemLimitationApplicable": false,
  "frenchTrainDetectionSystemLimitationNumber": "urn:ngsi-ld:FrenchTrainDetectionSystemLimitation:frenchTrainDetectionSystemLimitationNumber:PVYQ:85174183"
}