{"TestReport": {"description": "A summary of information based on the results of executing a TestScript.", "properties": {"resourceType": {"description": "This is a TestReport resource", "const": "TestReport"}, "id": {"description": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.", "$ref": "#/definitions/string"}, "meta": {"description": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content might not always be associated with version changes to the resource.", "$ref": "#/definitions/Meta"}, "implicitRules": {"description": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Often, this is a reference to an implementation guide that defines the special rules along with other profiles etc.", "$ref": "#/definitions/uri"}, "_implicitRules": {"description": "Extensions for implicitRules", "$ref": "#/definitions/Element"}, "language": {"description": "The base language in which the resource is written.", "$ref": "#/definitions/code"}, "_language": {"description": "Extensions for language", "$ref": "#/definitions/Element"}, "text": {"description": "A human-readable narrative that contains a summary of the resource and can be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.", "$ref": "#/definitions/Narrative"}, "contained": {"description": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.", "items": {"$ref": "#/definitions/ResourceList"}, "type": "array"}, "extension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "modifierExtension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource and that modifies the understanding of the element that contains it and/or the understanding of the containing element's descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "identifier": {"description": "Identifier for the TestScript assigned for external purposes outside the context of FHIR.", "$ref": "#/definitions/Identifier"}, "name": {"description": "A free text natural language name identifying the executed TestScript.", "$ref": "#/definitions/string"}, "_name": {"description": "Extensions for name", "$ref": "#/definitions/Element"}, "status": {"description": "The current state of this test report.", "$ref": "#/definitions/code"}, "_status": {"description": "Extensions for status", "$ref": "#/definitions/Element"}, "testScript": {"description": "Ideally this is an absolute URL that is used to identify the version-specific TestScript that was executed, matching the `TestScript.url`.", "$ref": "#/definitions/Reference"}, "result": {"description": "The overall result from the execution of the TestScript.", "$ref": "#/definitions/code"}, "_result": {"description": "Extensions for result", "$ref": "#/definitions/Element"}, "score": {"description": "The final score (percentage of tests passed) resulting from the execution of the TestScript.", "$ref": "#/definitions/decimal"}, "_score": {"description": "Extensions for score", "$ref": "#/definitions/Element"}, "tester": {"description": "Name of the tester producing this report (Organization or individual).", "$ref": "#/definitions/string"}, "_tester": {"description": "Extensions for tester", "$ref": "#/definitions/Element"}, "issued": {"description": "When the TestScript was executed and this TestReport was generated.", "$ref": "#/definitions/dateTime"}, "_issued": {"description": "Extensions for issued", "$ref": "#/definitions/Element"}, "participant": {"description": "A participant in the test execution, either the execution engine, a client, or a server.", "items": {"$ref": "#/definitions/TestReport_Participant"}, "type": "array"}, "setup": {"description": "The results of the series of required setup operations before the tests were executed.", "$ref": "#/definitions/TestReport_Setup"}, "test": {"description": "A test executed from the test script.", "items": {"$ref": "#/definitions/TestReport_Test"}, "type": "array"}, "teardown": {"description": "The results of the series of operations required to clean up after all the tests were executed (successfully or otherwise).", "$ref": "#/definitions/TestReport_Teardown"}}, "additionalProperties": false, "required": ["testScript", "resourceType"]}}