{"ValueSet": {"description": "A ValueSet resource instance specifies a set of codes drawn from one or more code systems, intended for use in a particular context. Value sets link between [CodeSystem](codesystem.html) definitions and their use in [coded elements](terminologies.html).", "properties": {"resourceType": {"description": "This is a ValueSet resource", "const": "ValueSet"}, "id": {"description": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.", "$ref": "#/definitions/string"}, "meta": {"description": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content might not always be associated with version changes to the resource.", "$ref": "#/definitions/Meta"}, "implicitRules": {"description": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Often, this is a reference to an implementation guide that defines the special rules along with other profiles etc.", "$ref": "#/definitions/uri"}, "_implicitRules": {"description": "Extensions for implicitRules", "$ref": "#/definitions/Element"}, "language": {"description": "The base language in which the resource is written.", "$ref": "#/definitions/code"}, "_language": {"description": "Extensions for language", "$ref": "#/definitions/Element"}, "text": {"description": "A human-readable narrative that contains a summary of the resource and can be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.", "$ref": "#/definitions/Narrative"}, "contained": {"description": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.", "items": {"$ref": "#/definitions/ResourceList"}, "type": "array"}, "extension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "modifierExtension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource and that modifies the understanding of the element that contains it and/or the understanding of the containing element's descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "url": {"description": "An absolute URI that is used to identify this value set when it is referenced in a specification, model, design or an instance; also called its canonical identifier. This SHOULD be globally unique and SHOULD be a literal address at which at which an authoritative instance of this value set is (or will be) published. This URL can be the target of a canonical reference. It SHALL remain the same when the value set is stored on different servers.", "$ref": "#/definitions/uri"}, "_url": {"description": "Extensions for url", "$ref": "#/definitions/Element"}, "identifier": {"description": "A formal identifier that is used to identify this value set when it is represented in other formats, or referenced in a specification, model, design or an instance.", "items": {"$ref": "#/definitions/Identifier"}, "type": "array"}, "version": {"description": "The identifier that is used to identify this version of the value set when it is referenced in a specification, model, design or instance. This is an arbitrary value managed by the value set author and is not expected to be globally unique. For example, it might be a timestamp (e.g. yyyymmdd) if a managed version is not available. There is also no expectation that versions can be placed in a lexicographical sequence.", "$ref": "#/definitions/string"}, "_version": {"description": "Extensions for version", "$ref": "#/definitions/Element"}, "name": {"description": "A natural language name identifying the value set. This name should be usable as an identifier for the module by machine processing applications such as code generation.", "$ref": "#/definitions/string"}, "_name": {"description": "Extensions for name", "$ref": "#/definitions/Element"}, "title": {"description": "A short, descriptive, user-friendly title for the value set.", "$ref": "#/definitions/string"}, "_title": {"description": "Extensions for title", "$ref": "#/definitions/Element"}, "status": {"description": "The status of this value set. Enables tracking the life-cycle of the content. The status of the value set applies to the value set definition (ValueSet.compose) and the associated ValueSet metadata. Expansions do not have a state.", "$ref": "#/definitions/code"}, "_status": {"description": "Extensions for status", "$ref": "#/definitions/Element"}, "experimental": {"description": "A Boolean value to indicate that this value set is authored for testing purposes (or education/evaluation/marketing) and is not intended to be used for genuine usage.", "$ref": "#/definitions/boolean"}, "_experimental": {"description": "Extensions for experimental", "$ref": "#/definitions/Element"}, "date": {"description": "The date (and optionally time) when the value set was created or revised (e.g. the 'content logical definition').", "$ref": "#/definitions/dateTime"}, "_date": {"description": "Extensions for date", "$ref": "#/definitions/Element"}, "publisher": {"description": "The name of the organization or individual that published the value set.", "$ref": "#/definitions/string"}, "_publisher": {"description": "Extensions for publisher", "$ref": "#/definitions/Element"}, "contact": {"description": "Contact details to assist a user in finding and communicating with the publisher.", "items": {"$ref": "#/definitions/ContactDetail"}, "type": "array"}, "description": {"description": "A free text natural language description of the value set from a consumer's perspective. The textual description specifies the span of meanings for concepts to be included within the Value Set Expansion, and also may specify the intended use and limitations of the Value Set.", "$ref": "#/definitions/markdown"}, "_description": {"description": "Extensions for description", "$ref": "#/definitions/Element"}, "useContext": {"description": "The content was developed with a focus and intent of supporting the contexts that are listed. These contexts may be general categories (gender, age, ...) or may be references to specific programs (insurance plans, studies, ...) and may be used to assist with indexing and searching for appropriate value set instances.", "items": {"$ref": "#/definitions/UsageContext"}, "type": "array"}, "jurisdiction": {"description": "A legal or geographic region in which the value set is intended to be used.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "immutable": {"description": "If this is set to 'true', then no new versions of the content logical definition can be created.  Note: Other metadata might still change.", "$ref": "#/definitions/boolean"}, "_immutable": {"description": "Extensions for immutable", "$ref": "#/definitions/Element"}, "purpose": {"description": "Explanation of why this value set is needed and why it has been designed as it has.", "$ref": "#/definitions/markdown"}, "_purpose": {"description": "Extensions for purpose", "$ref": "#/definitions/Element"}, "copyright": {"description": "A copyright statement relating to the value set and/or its contents. Copyright statements are generally legal restrictions on the use and publishing of the value set.", "$ref": "#/definitions/markdown"}, "_copyright": {"description": "Extensions for copyright", "$ref": "#/definitions/Element"}, "compose": {"description": "A set of criteria that define the contents of the value set by including or excluding codes selected from the specified code system(s) that the value set draws from. This is also known as the Content Logical Definition (CLD).", "$ref": "#/definitions/ValueSet_Compose"}, "expansion": {"description": "A value set can also be \"expanded\", where the value set is turned into a simple collection of enumerated codes. This element holds the expansion, if it has been performed.", "$ref": "#/definitions/ValueSet_Expansion"}}, "additionalProperties": false, "required": ["resourceType"]}}