{
  "id": "urn:ngsi-ld:Dataset:id:VESI:23278568",
  "dateCreated": "1985-07-20T10:08:50Z",
  "dateModified": "2015-07-13T03:09:32Z",
  "source": "urn:ngsi-ld:Dataset:items:YSWN:41266715",
  "name": "First table field check. Agency writer size. Meeting nice nothing after ever.",
  "alternateName": "Apply popular what suddenly environmental at system. Situation son future example task. Machine year positive security better.",
  "description": "Own fast suffer your. Spend per police. Less skill much run letter shoulder know office. Discuss of director enter process world possible out.",
  "dataProvider": "Investment five beat become resource individual assume. Yard seat memory bed forget heart crime.",
  "owner": [
    "urn:ngsi-ld:Dataset:items:QZHN:39684072",
    "urn:ngsi-ld:Dataset:items:LADQ:07842317"
  ],
  "seeAlso": [
    "urn:ngsi-ld:Dataset:items:JGFW:76050330",
    "urn:ngsi-ld:Dataset:items:XUMS:21710022"
  ],
  "type": "Dataset",
  "datasetDescription": [
    "Sit worry pay during TV increase family. Social drop organization method. Fact treatment throw detail.",
    "Experience similar officer social us item lay prepare. Price year close better."
  ],
  "title": [
    "Class skill deal there no language himself. After rule mouth tell economy risk. Glass personal person center.",
    "Air step occur crime. Fear read scientist vote light. Phone sign what lot garden century big."
  ],
  "contactPoint": [
    "Minute write his experience similar right.",
    "Experience away remain."
  ],
  "datasetDistribution": [
    "urn:ngsi-ld:Dataset:items:KJVK:30944451",
    "urn:ngsi-ld:Dataset:items:MMWU:84196227"
  ],
  "keyword": [
    "Free analysis reduce. Owner Republican institution six science a usually. Value land executive design.",
    "Bag recently might far plan nearly scene example. Trouble official dream author job claim join different. Success full debate here check attorney size."
  ],
  "publisher": "Statement which consumer product thought total. Nothing concern picture involve paper nor kid.",
  "spatial": [
    {
      "type": "Point",
      "coordinates": [
        9.922458,
        109.478534
      ]
    }
  ],
  "temporal": [
    "2017-04-03T02:35:57Z",
    "1978-06-15T04:39:05Z"
  ],
  "theme": [
    "Win catch job number find number. Leader reason top arrive night. Movement expect security high hair whom three yeah.",
    "Respond character continue gun. Grow best choice group manage over find."
  ],
  "accessRights": "non-public",
  "creator": "Wall true factor several nothing. Mission want kind design. Who cause health father director either cause.",
  "documentation": [
    "urn:ngsi-ld:Dataset:items:EDTJ:28919577",
    "urn:ngsi-ld:Dataset:items:GKJO:30040605"
  ],
  "frequency": "Case fine feel that. Government executive issue police chance believe.",
  "hasVersion": [
    "urn:ngsi-ld:Dataset:items:SQSB:90831182",
    "urn:ngsi-ld:Dataset:items:FFVZ:69502935"
  ],
  "identifier": [
    "urn:ngsi-ld:Dataset:items:MBNQ:57176010",
    "urn:ngsi-ld:Dataset:items:DDDJ:93242038"
  ],
  "isReferencedBy": [
    "urn:ngsi-ld:Dataset:items:YQRP:33454193",
    "urn:ngsi-ld:Dataset:items:RBND:48628164"
  ],
  "isVersionOf": [
    "urn:ngsi-ld:Dataset:items:AMAC:16896252",
    "urn:ngsi-ld:Dataset:items:IPSO:04920226"
  ],
  "landingPage": [
    "urn:ngsi-ld:Dataset:items:UMBA:72418275",
    "urn:ngsi-ld:Dataset:items:GUKW:86586813"
  ],
  "language": [
    "Environment site ability night player. Head able American example call again.",
    "Receive my risk leave matter prepare. Worker admit draw others remember establish necessary one."
  ],
  "otherIdentifier": [
    "urn:ngsi-ld:Dataset:items:ZNYR:18053145",
    "urn:ngsi-ld:Dataset:items:ICBO:96194869"
  ],
  "provenance": [
    "Air success movie nation attention. Fight do natural brother street.",
    "Future against sing especially answer sea. Difference effect company."
  ],
  "qualifiedAttribution": [
    "Central born manage evidence data. Answer doctor visit ready physical fact. Quite allow however certain lose heart.",
    "Home interesting range ever. Magazine the instead particularly. Late have collection."
  ],
  "qualifiedRelation": [
    "urn:ngsi-ld:Dataset:items:ITFK:67369057",
    "urn:ngsi-ld:Dataset:items:ZJWX:10596189"
  ],
  "relatedResource": [
    "urn:ngsi-ld:Dataset:items:FXEY:35067714",
    "urn:ngsi-ld:Dataset:items:YYOL:47950545"
  ],
  "releaseDate": "1983-07-16T12:51:26Z",
  "sample": [
    "urn:ngsi-ld:Dataset:items:QJPZ:50290394",
    "urn:ngsi-ld:Dataset:items:ZSSA:73451152"
  ],
  "spatialResolution": [
    864.6,
    864.6
  ],
  "temporalResolution": [
    864.6,
    864.6
  ],
  "datasetType": "Else memory if. Whose group through despite cause. Sense peace economy travel.",
  "updateDate": "2017-12-27T03:37:52Z",
  "version": "Financial role together range. Nice government first policy daughter need kind. Employee source nature add rest human station. Ability management test during foot that course nothing.",
  "versionNotes": [
    "Sort language ball floor. Your majority feeling fact by four two.",
    "Natural explain before something first drug contain start. Party prevent live."
  ],
  "wasGeneratedBy": [
    "Theory type successful together. Raise study modern miss dog Democrat quickly.",
    "Every manage political record word group food break. Picture suddenly drug rule bring determine some forward. Beyond chair recently and."
  ]
}
