{"Contract": {"description": "Legally enforceable, formally recorded unilateral or bilateral directive i.e., a policy or agreement.", "properties": {"resourceType": {"description": "This is a Contract resource", "const": "Contract"}, "id": {"description": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.", "$ref": "#/definitions/string"}, "meta": {"description": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content might not always be associated with version changes to the resource.", "$ref": "#/definitions/Meta"}, "implicitRules": {"description": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Often, this is a reference to an implementation guide that defines the special rules along with other profiles etc.", "$ref": "#/definitions/uri"}, "_implicitRules": {"description": "Extensions for implicitRules", "$ref": "#/definitions/Element"}, "language": {"description": "The base language in which the resource is written.", "$ref": "#/definitions/code"}, "_language": {"description": "Extensions for language", "$ref": "#/definitions/Element"}, "text": {"description": "A human-readable narrative that contains a summary of the resource and can be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.", "$ref": "#/definitions/Narrative"}, "contained": {"description": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.", "items": {"$ref": "#/definitions/ResourceList"}, "type": "array"}, "extension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "modifierExtension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource and that modifies the understanding of the element that contains it and/or the understanding of the containing element's descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "identifier": {"description": "Unique identifier for this Contract or a derivative that references a Source Contract.", "items": {"$ref": "#/definitions/Identifier"}, "type": "array"}, "url": {"description": "Canonical identifier for this contract, represented as a URI (globally unique).", "$ref": "#/definitions/uri"}, "_url": {"description": "Extensions for url", "$ref": "#/definitions/Element"}, "version": {"description": "An edition identifier used for business purposes to label business significant variants.", "$ref": "#/definitions/string"}, "_version": {"description": "Extensions for version", "$ref": "#/definitions/Element"}, "status": {"description": "The status of the resource instance.", "$ref": "#/definitions/code"}, "_status": {"description": "Extensions for status", "$ref": "#/definitions/Element"}, "legalState": {"description": "Legal states of the formation of a legal instrument, which is a formally executed written document that can be formally attributed to its author, records and formally expresses a legally enforceable act, process, or contractual duty, obligation, or right, and therefore evidences that act, process, or agreement.", "$ref": "#/definitions/CodeableConcept"}, "instantiatesCanonical": {"description": "The URL pointing to a FHIR-defined Contract Definition that is adhered to in whole or part by this Contract.", "$ref": "#/definitions/Reference"}, "instantiatesUri": {"description": "The URL pointing to an externally maintained definition that is adhered to in whole or in part by this Contract.", "$ref": "#/definitions/uri"}, "_instantiatesUri": {"description": "Extensions for instantiatesUri", "$ref": "#/definitions/Element"}, "contentDerivative": {"description": "The minimal content derived from the basal information source at a specific stage in its lifecycle.", "$ref": "#/definitions/CodeableConcept"}, "issued": {"description": "When this  Contract was issued.", "$ref": "#/definitions/dateTime"}, "_issued": {"description": "Extensions for issued", "$ref": "#/definitions/Element"}, "applies": {"description": "Relevant time or time-period when this Contract is applicable.", "$ref": "#/definitions/Period"}, "expirationType": {"description": "Event resulting in discontinuation or termination of this Contract instance by one or more parties to the contract.", "$ref": "#/definitions/CodeableConcept"}, "subject": {"description": "The target entity impacted by or of interest to parties to the agreement.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "authority": {"description": "A formally or informally recognized grouping of people, principals, organizations, or jurisdictions formed for the purpose of achieving some form of collective action such as the promulgation, administration and enforcement of contracts and policies.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "domain": {"description": "Recognized governance framework or system operating with a circumscribed scope in accordance with specified principles, policies, processes or procedures for managing rights, actions, or behaviors of parties or principals relative to resources.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "site": {"description": "Sites in which the contract is complied with,  exercised, or in force.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "name": {"description": "A natural language name identifying this Contract definition, derivative, or instance in any legal state. Provides additional information about its content. This name should be usable as an identifier for the module by machine processing applications such as code generation.", "$ref": "#/definitions/string"}, "_name": {"description": "Extensions for name", "$ref": "#/definitions/Element"}, "title": {"description": "A short, descriptive, user-friendly title for this Contract definition, derivative, or instance in any legal state.t giving additional information about its content.", "$ref": "#/definitions/string"}, "_title": {"description": "Extensions for title", "$ref": "#/definitions/Element"}, "subtitle": {"description": "An explanatory or alternate user-friendly title for this Contract definition, derivative, or instance in any legal state.t giving additional information about its content.", "$ref": "#/definitions/string"}, "_subtitle": {"description": "Extensions for subtitle", "$ref": "#/definitions/Element"}, "alias": {"description": "Alternative representation of the title for this Contract definition, derivative, or instance in any legal state., e.g., a domain specific contract number related to legislation.", "items": {"$ref": "#/definitions/string"}, "type": "array"}, "_alias": {"description": "Extensions for alias", "items": {"$ref": "#/definitions/Element"}, "type": "array"}, "author": {"description": "The individual or organization that authored the Contract definition, derivative, or instance in any legal state.", "$ref": "#/definitions/Reference"}, "scope": {"description": "A selector of legal concerns for this Contract definition, derivative, or instance in any legal state.", "$ref": "#/definitions/CodeableConcept"}, "topicCodeableConcept": {"description": "Narrows the range of legal concerns to focus on the achievement of specific contractual objectives.", "$ref": "#/definitions/CodeableConcept"}, "topicReference": {"description": "Narrows the range of legal concerns to focus on the achievement of specific contractual objectives.", "$ref": "#/definitions/Reference"}, "type": {"description": "A high-level category for the legal instrument, whether constructed as a Contract definition, derivative, or instance in any legal state.  Provides additional information about its content within the context of the Contract's scope to distinguish the kinds of systems that would be interested in the contract.", "$ref": "#/definitions/CodeableConcept"}, "subType": {"description": "Sub-category for the Contract that distinguishes the kinds of systems that would be interested in the Contract within the context of the Contract's scope.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "contentDefinition": {"description": "Precusory content developed with a focus and intent of supporting the formation a Contract instance, which may be associated with and transformable into a Contract.", "$ref": "#/definitions/Contract_ContentDefinition"}, "term": {"description": "One or more Contract Provisions, which may be related and conveyed as a group, and may contain nested groups.", "items": {"$ref": "#/definitions/Contract_Term"}, "type": "array"}, "supportingInfo": {"description": "Information that may be needed by/relevant to the performer in their execution of this term action.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "relevantHistory": {"description": "Links to Provenance records for past versions of this Contract definition, derivative, or instance, which identify key state transitions or updates that are likely to be relevant to a user looking at the current version of the Contract.  The Provence.entity indicates the target that was changed in the update. http://build.fhir.org/provenance-definitions.html#Provenance.entity.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "signer": {"description": "Parties with legal standing in the Contract, including the principal parties, the grantor(s) and grantee(s), which are any person or organization bound by the contract, and any ancillary parties, which facilitate the execution of the contract such as a notary or witness.", "items": {"$ref": "#/definitions/Contract_Signer"}, "type": "array"}, "friendly": {"description": "The \"patient friendly language\" versionof the Contract in whole or in parts. \"Patient friendly language\" means the representation of the Contract and Contract Provisions in a manner that is readily accessible and understandable by a layperson in accordance with best practices for communication styles that ensure that those agreeing to or signing the Contract understand the roles, actions, obligations, responsibilities, and implication of the agreement.", "items": {"$ref": "#/definitions/Contract_Friendly"}, "type": "array"}, "legal": {"description": "List of Legal expressions or representations of this Contract.", "items": {"$ref": "#/definitions/Contract_Legal"}, "type": "array"}, "rule": {"description": "List of Computable Policy Rule Language Representations of this Contract.", "items": {"$ref": "#/definitions/Contract_Rule"}, "type": "array"}, "legallyBindingAttachment": {"description": "Legally binding Contract: This is the signed and legally recognized representation of the Contract, which is considered the \"source of truth\" and which would be the basis for legal action related to enforcement of this Contract.", "$ref": "#/definitions/Attachment"}, "legallyBindingReference": {"description": "Legally binding Contract: This is the signed and legally recognized representation of the Contract, which is considered the \"source of truth\" and which would be the basis for legal action related to enforcement of this Contract.", "$ref": "#/definitions/Reference"}}, "additionalProperties": false, "required": ["resourceType"]}}