{"MolecularSequence": {"description": "Raw data describing a biological sequence.", "properties": {"resourceType": {"description": "This is a MolecularSequence resource", "const": "MolecularSequence"}, "id": {"description": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.", "$ref": "#/definitions/string"}, "meta": {"description": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content might not always be associated with version changes to the resource.", "$ref": "#/definitions/Meta"}, "implicitRules": {"description": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Often, this is a reference to an implementation guide that defines the special rules along with other profiles etc.", "$ref": "#/definitions/uri"}, "_implicitRules": {"description": "Extensions for implicitRules", "$ref": "#/definitions/Element"}, "language": {"description": "The base language in which the resource is written.", "$ref": "#/definitions/code"}, "_language": {"description": "Extensions for language", "$ref": "#/definitions/Element"}, "text": {"description": "A human-readable narrative that contains a summary of the resource and can be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.", "$ref": "#/definitions/Narrative"}, "contained": {"description": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.", "items": {"$ref": "#/definitions/ResourceList"}, "type": "array"}, "extension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "modifierExtension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource and that modifies the understanding of the element that contains it and/or the understanding of the containing element's descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "identifier": {"description": "A unique identifier for this particular sequence instance. This is a FHIR-defined id.", "items": {"$ref": "#/definitions/Identifier"}, "type": "array"}, "type": {"description": "Amino Acid Sequence/ DNA Sequence / RNA Sequence.", "$ref": "#/definitions/code"}, "_type": {"description": "Extensions for type", "$ref": "#/definitions/Element"}, "coordinateSystem": {"description": "Whether the sequence is numbered starting at 0 (0-based numbering or coordinates, inclusive start, exclusive end) or starting at 1 (1-based numbering, inclusive start and inclusive end).", "$ref": "#/definitions/integer"}, "_coordinateSystem": {"description": "Extensions for coordinateSystem", "$ref": "#/definitions/Element"}, "patient": {"description": "The patient whose sequencing results are described by this resource.", "$ref": "#/definitions/Reference"}, "specimen": {"description": "Specimen used for sequencing.", "$ref": "#/definitions/Reference"}, "device": {"description": "The method for sequencing, for example, chip information.", "$ref": "#/definitions/Reference"}, "performer": {"description": "The organization or lab that should be responsible for this result.", "$ref": "#/definitions/Reference"}, "quantity": {"description": "The number of copies of the sequence of interest. (RNASeq).", "$ref": "#/definitions/Quantity"}, "referenceSeq": {"description": "A sequence that is used as a reference to describe variants that are present in a sequence analyzed.", "$ref": "#/definitions/MolecularSequence_ReferenceSeq"}, "variant": {"description": "The definition of variant here originates from Sequence ontology ([variant_of](http://www.sequenceontology.org/browser/current_svn/term/variant_of)). This element can represent amino acid or nucleic sequence change(including insertion,deletion,SNP,etc.)  It can represent some complex mutation or segment variation with the assist of CIGAR string.", "items": {"$ref": "#/definitions/MolecularSequence_Variant"}, "type": "array"}, "observedSeq": {"description": "Sequence that was observed. It is the result marked by referenceSeq along with variant records on referenceSeq. This shall start from referenceSeq.windowStart and end by referenceSeq.windowEnd.", "$ref": "#/definitions/string"}, "_observedSeq": {"description": "Extensions for observedSeq", "$ref": "#/definitions/Element"}, "quality": {"description": "An experimental feature attribute that defines the quality of the feature in a quantitative way, such as a phred quality score ([SO:0001686](http://www.sequenceontology.org/browser/current_svn/term/SO:0001686)).", "items": {"$ref": "#/definitions/MolecularSequence_Quality"}, "type": "array"}, "readCoverage": {"description": "Coverage (read depth or depth) is the average number of reads representing a given nucleotide in the reconstructed sequence.", "$ref": "#/definitions/integer"}, "_readCoverage": {"description": "Extensions for readCoverage", "$ref": "#/definitions/Element"}, "repository": {"description": "Configurations of the external repository. The repository shall store target's observedSeq or records related with target's observedSeq.", "items": {"$ref": "#/definitions/MolecularSequence_Repository"}, "type": "array"}, "pointer": {"description": "Pointer to next atomic sequence which at most contains one variant.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "structureVariant": {"description": "Information about chromosome structure variation.", "items": {"$ref": "#/definitions/MolecularSequence_StructureVariant"}, "type": "array"}}, "additionalProperties": false, "required": ["resourceType"]}}