{"Composition": {"description": "A set of healthcare-related information that is assembled together into a single logical package that provides a single coherent statement of meaning, establishes its own context and that has clinical attestation with regard to who is making the statement. A Composition defines the structure and narrative content necessary for a document. However, a Composition alone does not constitute a document. Rather, the Composition must be the first entry in a Bundle where Bundle.type=document, and any other resources referenced from Composition must be included as subsequent entries in the Bundle (for example Patient, Practitioner, Encounter, etc.).", "properties": {"resourceType": {"description": "This is a Composition resource", "const": "Composition"}, "id": {"description": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.", "$ref": "#/definitions/string"}, "meta": {"description": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content might not always be associated with version changes to the resource.", "$ref": "#/definitions/Meta"}, "implicitRules": {"description": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Often, this is a reference to an implementation guide that defines the special rules along with other profiles etc.", "$ref": "#/definitions/uri"}, "_implicitRules": {"description": "Extensions for implicitRules", "$ref": "#/definitions/Element"}, "language": {"description": "The base language in which the resource is written.", "$ref": "#/definitions/code"}, "_language": {"description": "Extensions for language", "$ref": "#/definitions/Element"}, "text": {"description": "A human-readable narrative that contains a summary of the resource and can be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.", "$ref": "#/definitions/Narrative"}, "contained": {"description": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.", "items": {"$ref": "#/definitions/ResourceList"}, "type": "array"}, "extension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "modifierExtension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource and that modifies the understanding of the element that contains it and/or the understanding of the containing element's descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "identifier": {"description": "A version-independent identifier for the Composition. This identifier stays constant as the composition is changed over time.", "$ref": "#/definitions/Identifier"}, "status": {"description": "The workflow/clinical status of this composition. The status is a marker for the clinical standing of the document.", "$ref": "#/definitions/code"}, "_status": {"description": "Extensions for status", "$ref": "#/definitions/Element"}, "type": {"description": "Specifies the particular kind of composition (e.g. History and Physical, Discharge Summary, Progress Note). This usually equates to the purpose of making the composition.", "$ref": "#/definitions/CodeableConcept"}, "category": {"description": "A categorization for the type of the composition - helps for indexing and searching. This may be implied by or derived from the code specified in the Composition Type.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "subject": {"description": "Who or what the composition is about. The composition can be about a person, (patient or healthcare practitioner), a device (e.g. a machine) or even a group of subjects (such as a document about a herd of livestock, or a set of patients that share a common exposure).", "$ref": "#/definitions/Reference"}, "encounter": {"description": "Describes the clinical encounter or type of care this documentation is associated with.", "$ref": "#/definitions/Reference"}, "date": {"description": "The composition editing time, when the composition was last logically changed by the author.", "$ref": "#/definitions/dateTime"}, "_date": {"description": "Extensions for date", "$ref": "#/definitions/Element"}, "author": {"description": "Identifies who is responsible for the information in the composition, not necessarily who typed it in.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "title": {"description": "Official human-readable label for the composition.", "$ref": "#/definitions/string"}, "_title": {"description": "Extensions for title", "$ref": "#/definitions/Element"}, "confidentiality": {"description": "The code specifying the level of confidentiality of the Composition.", "$ref": "#/definitions/code"}, "_confidentiality": {"description": "Extensions for confidentiality", "$ref": "#/definitions/Element"}, "attester": {"description": "A participant who has attested to the accuracy of the composition/document.", "items": {"$ref": "#/definitions/Composition_Attester"}, "type": "array"}, "custodian": {"description": "Identifies the organization or group who is responsible for ongoing maintenance of and access to the composition/document information.", "$ref": "#/definitions/Reference"}, "relatesTo": {"description": "Relationships that this composition has with other compositions or documents that already exist.", "items": {"$ref": "#/definitions/Composition_RelatesTo"}, "type": "array"}, "event": {"description": "The clinical service, such as a colonoscopy or an appendectomy, being documented.", "items": {"$ref": "#/definitions/Composition_Event"}, "type": "array"}, "section": {"description": "The root of the sections that make up the composition.", "items": {"$ref": "#/definitions/Composition_Section"}, "type": "array"}}, "additionalProperties": false, "required": ["author", "type", "resourceType"]}}