{"DeviceDefinition": {"description": "The characteristics, operational status and capabilities of a medical-related component of a medical device.", "properties": {"resourceType": {"description": "This is a DeviceDefinition resource", "const": "DeviceDefinition"}, "id": {"description": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.", "$ref": "#/definitions/string"}, "meta": {"description": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content might not always be associated with version changes to the resource.", "$ref": "#/definitions/Meta"}, "implicitRules": {"description": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Often, this is a reference to an implementation guide that defines the special rules along with other profiles etc.", "$ref": "#/definitions/uri"}, "_implicitRules": {"description": "Extensions for implicitRules", "$ref": "#/definitions/Element"}, "language": {"description": "The base language in which the resource is written.", "$ref": "#/definitions/code"}, "_language": {"description": "Extensions for language", "$ref": "#/definitions/Element"}, "text": {"description": "A human-readable narrative that contains a summary of the resource and can be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.", "$ref": "#/definitions/Narrative"}, "contained": {"description": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.", "items": {"$ref": "#/definitions/ResourceList"}, "type": "array"}, "extension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "modifierExtension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource and that modifies the understanding of the element that contains it and/or the understanding of the containing element's descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "identifier": {"description": "Unique instance identifiers assigned to a device by the software, manufacturers, other organizations or owners. For example: handle ID.", "items": {"$ref": "#/definitions/Identifier"}, "type": "array"}, "udiDeviceIdentifier": {"description": "Unique device identifier (UDI) assigned to device label or package.  Note that the Device may include multiple udiCarriers as it either may include just the udiCarrier for the jurisdiction it is sold, or for multiple jurisdictions it could have been sold.", "items": {"$ref": "#/definitions/DeviceDefinition_UdiDeviceIdentifier"}, "type": "array"}, "manufacturerString": {"description": "A name of the manufacturer.", "pattern": "^[ \\r\\n\\t\\S]+$", "type": "string"}, "_manufacturerString": {"description": "Extensions for manufacturerString", "$ref": "#/definitions/Element"}, "manufacturerReference": {"description": "A name of the manufacturer.", "$ref": "#/definitions/Reference"}, "deviceName": {"description": "A name given to the device to identify it.", "items": {"$ref": "#/definitions/DeviceDefinition_DeviceName"}, "type": "array"}, "modelNumber": {"description": "The model number for the device.", "$ref": "#/definitions/string"}, "_modelNumber": {"description": "Extensions for modelNumber", "$ref": "#/definitions/Element"}, "type": {"description": "What kind of device or device system this is.", "$ref": "#/definitions/CodeableConcept"}, "specialization": {"description": "The capabilities supported on a  device, the standards to which the device conforms for a particular purpose, and used for the communication.", "items": {"$ref": "#/definitions/DeviceDefinition_Specialization"}, "type": "array"}, "version": {"description": "The available versions of the device, e.g., software versions.", "items": {"$ref": "#/definitions/string"}, "type": "array"}, "_version": {"description": "Extensions for version", "items": {"$ref": "#/definitions/Element"}, "type": "array"}, "safety": {"description": "Safety characteristics of the device.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "shelfLifeStorage": {"description": "Shelf Life and storage information.", "items": {"$ref": "#/definitions/ProductShelfLife"}, "type": "array"}, "physicalCharacteristics": {"description": "Dimensions, color etc.", "$ref": "#/definitions/ProdCharacteristic"}, "languageCode": {"description": "Language code for the human-readable text strings produced by the device (all supported).", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "capability": {"description": "Device capabilities.", "items": {"$ref": "#/definitions/DeviceDefinition_Capability"}, "type": "array"}, "property": {"description": "The actual configuration settings of a device as it actually operates, e.g., regulation status, time properties.", "items": {"$ref": "#/definitions/DeviceDefinition_Property"}, "type": "array"}, "owner": {"description": "An organization that is responsible for the provision and ongoing maintenance of the device.", "$ref": "#/definitions/Reference"}, "contact": {"description": "Contact details for an organization or a particular human that is responsible for the device.", "items": {"$ref": "#/definitions/ContactPoint"}, "type": "array"}, "url": {"description": "A network address on which the device may be contacted directly.", "$ref": "#/definitions/uri"}, "_url": {"description": "Extensions for url", "$ref": "#/definitions/Element"}, "onlineInformation": {"description": "Access to on-line information about the device.", "$ref": "#/definitions/uri"}, "_onlineInformation": {"description": "Extensions for onlineInformation", "$ref": "#/definitions/Element"}, "note": {"description": "Descriptive information, usage information or implantation information that is not captured in an existing element.", "items": {"$ref": "#/definitions/Annotation"}, "type": "array"}, "quantity": {"description": "The quantity of the device present in the packaging (e.g. the number of devices present in a pack, or the number of devices in the same package of the medicinal product).", "$ref": "#/definitions/Quantity"}, "parentDevice": {"description": "The parent device it can be part of.", "$ref": "#/definitions/Reference"}, "material": {"description": "A substance used to create the material(s) of which the device is made.", "items": {"$ref": "#/definitions/DeviceDefinition_Material"}, "type": "array"}}, "additionalProperties": false, "required": ["resourceType"]}}