{"header": {"type": "Header", "description": "Property.  This message defines meta information for a camera. It should be in a  camera namespace on topic \"camera_info\" and accompanied by up to five  image topics named:   image_raw - raw data from the camera driver, possibly Bayer encoded  image - monochrome, distorted  image_color - color, distorted  image_rect - monochrome, rectified  image_rect_color - color, rectified   The image_pipeline contains packages (image_proc, stereo_image_proc)  for producing the four processed image topics from image_raw and  camera_info. The meaning of the camera parameters are described in  detail at http://www.ros.org/wiki/image_pipeline/CameraInfo.   The image_geometry package provides a user-friendly interface to  common operations using this meta information. If you want to, e.g.,  project a 3d point into image coordinates, we strongly recommend  using image_geometry.   If the camera is uncalibrated, the matrices D, K, R, P should be left  zeroed out. In particular, clients may assume that K[0] == 0.0  indicates an uncalibrated camera. ######################################################################  Image acquisition info # ######################################################################  Time of image acquisition, camera coordinate frame ID  Header timestamp should be acquisition time of image "}, "height": {"type": "integer", "minimum": 0, "description": "Property.  Header frame_id should be optical frame of camera  origin of frame should be optical center of camera  +x should point to the right in the image  +y should point down in the image  +z should point into the plane of the image ######################################################################  Calibration Parameters # ######################################################################  These are fixed during camera calibration. Their values will be the #  same in all messages until the camera is recalibrated. Note that #  self-calibrating systems may \"recalibrate\" frequently. #  #  The internal parameters can be used to warp a raw (distorted) image #  to: #  1. An undistorted image (requires D and K) #  2. A rectified image (requires D, K, R) #  The projection matrix P projects 3D points into the rectified image.# ######################################################################  The image dimensions with which the camera was calibrated. Normally  this will be the full camera resolution in pixels. "}, "width": {"type": "integer", "minimum": 0, "description": "Property. "}, "distortion_model": {"type": "string", "description": "Property.  The distortion model used. Supported models are listed in  sensor_msgs/distortion_models.h. For most cameras, \"plumb_bob\" - a  simple model of radial and tangential distortion - is sufficient. "}, "D": {"type": "array", "items": {"type": "number"}}, "K": {"type": "array", "items": {"type": "number"}, "maxitems": 9}, "R": {"type": "array", "items": {"type": "number"}, "maxitems": 9}, "P": {"type": "array", "items": {"type": "number"}, "maxitems": 12}, "binning_x": {"type": "integer", "minimum": 0, "description": "Property. ######################################################################  Operational Parameters # ######################################################################  These define the image region actually captured by the camera #  driver. Although they affect the geometry of the output image, they #  may be changed freely without recalibrating the camera. # ######################################################################  Binning refers here to any camera setting which combines rectangular  neighborhoods of pixels into larger \"super-pixels.\" It reduces the  resolution of the output image to  (width / binning_x) x (height / binning_y).  The default values binning_x = binning_y = 0 is considered the same  as binning_x = binning_y = 1 (no subsampling). "}, "binning_y": {"type": "integer", "minimum": 0, "description": "Property. "}, "roi": {"type": "RegionOfInterest", "description": "Property.  Region of interest (subwindow of full camera resolution), given in  full resolution (unbinned) image coordinates. A particular ROI  always denotes the same window of pixels on the camera sensor,  regardless of binning settings.  The default setting of roi (all values 0) is considered the same as  full resolution (roi.width = width, roi.height = height). "}}