{"header": {"type": "Header", "description": "Property. A header, used for interpreting the poses "}, "pose": {"type": "geometry_msgs/Pose", "description": "Property. DISCLAIMER: This field is not in use yet and all other poses are still interpreted in the header frame. https://github.com/ros-planning/moveit/pull/2037 implements the actual logic for this field. --- The object's pose relative to the header frame. The shapes and subframe poses are defined relative to this pose. "}, "id": {"type": "string", "description": "Property. The id of the object (name used in MoveIt) "}, "type": {"type": "object_recognition_msgs/ObjectType", "description": "Property. The object type in a database of known objects "}, "primitives": {"type": "array", "description": "Property. The collision geometries associated with the object. Their poses are with respect to the object's pose Solid geometric primitives ", "items": {"type": "shape_msgs/SolidPrimitive"}}, "primitive_poses": {"type": "array", "description": "Property. ", "items": {"type": "geometry_msgs/Pose"}}, "meshes": {"type": "array", "description": "Property. Meshes ", "items": {"type": "shape_msgs/Mesh"}}, "mesh_poses": {"type": "array", "description": "Property. ", "items": {"type": "geometry_msgs/Pose"}}, "planes": {"type": "array", "description": "Property. Bounding planes (equation is specified, but the plane can be oriented using an additional pose) ", "items": {"type": "shape_msgs/Plane"}}, "plane_poses": {"type": "array", "description": "Property. ", "items": {"type": "geometry_msgs/Pose"}}, "subframe_names": {"type": "array", "description": "Property. Named subframes on the object. Use these to define points of interest on the object that you want to plan with (e.g. \"tip\", \"spout\", \"handle\"). The id of the object will be prepended to the subframe. If an object with the id \"screwdriver\" and a subframe \"tip\" is in the scene, you can use the frame \"screwdriver/tip\" for planning. The length of the subframe_names and subframe_poses has to be identical. ", "items": {"type": "string"}}, "subframe_poses": {"type": "array", "description": "Property. ", "items": {"type": "geometry_msgs/Pose"}}, "ADD=0": {"type": "byte", "description": "Property. Adds the object to the planning scene. If the object previously existed, it is replaced. "}, "REMOVE=1": {"type": "byte", "description": "Property. Removes the object from the environment entirely (everything that matches the specified id) "}, "APPEND=2": {"type": "byte", "description": "Property. Append to an object that already exists in the planning scene. If the object does not exist, it is added. "}, "MOVE=3": {"type": "byte", "description": "Property. If an object already exists in the scene, new poses can be sent (the geometry arrays must be left empty) if solely moving the object is desired "}, "operation": {"type": "byte", "description": "Property. Operation to be performed "}}