{"AdverseEvent": {"description": "Actual or  potential/avoided event causing unintended physical injury resulting from or contributed to by medical care, a research study or other healthcare setting factors that requires additional monitoring, treatment, or hospitalization, or that results in death.", "properties": {"resourceType": {"description": "This is a AdverseEvent resource", "const": "AdverseEvent"}, "id": {"description": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.", "$ref": "#/definitions/string"}, "meta": {"description": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content might not always be associated with version changes to the resource.", "$ref": "#/definitions/Meta"}, "implicitRules": {"description": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Often, this is a reference to an implementation guide that defines the special rules along with other profiles etc.", "$ref": "#/definitions/uri"}, "_implicitRules": {"description": "Extensions for implicitRules", "$ref": "#/definitions/Element"}, "language": {"description": "The base language in which the resource is written.", "$ref": "#/definitions/code"}, "_language": {"description": "Extensions for language", "$ref": "#/definitions/Element"}, "text": {"description": "A human-readable narrative that contains a summary of the resource and can be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.", "$ref": "#/definitions/Narrative"}, "contained": {"description": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.", "items": {"$ref": "#/definitions/ResourceList"}, "type": "array"}, "extension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "modifierExtension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource and that modifies the understanding of the element that contains it and/or the understanding of the containing element's descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "identifier": {"description": "Business identifiers assigned to this adverse event by the performer or other systems which remain constant as the resource is updated and propagates from server to server.", "$ref": "#/definitions/Identifier"}, "actuality": {"description": "Whether the event actually happened, or just had the potential to. Note that this is independent of whether anyone was affected or harmed or how severely.", "$ref": "#/definitions/code"}, "_actuality": {"description": "Extensions for actuality", "$ref": "#/definitions/Element"}, "category": {"description": "The overall type of event, intended for search and filtering purposes.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "event": {"description": "This element defines the specific type of event that occurred or that was prevented from occurring.", "$ref": "#/definitions/CodeableConcept"}, "subject": {"description": "This subject or group impacted by the event.", "$ref": "#/definitions/Reference"}, "encounter": {"description": "The Encounter during which AdverseEvent was created or to which the creation of this record is tightly associated.", "$ref": "#/definitions/Reference"}, "date": {"description": "The date (and perhaps time) when the adverse event occurred.", "$ref": "#/definitions/dateTime"}, "_date": {"description": "Extensions for date", "$ref": "#/definitions/Element"}, "detected": {"description": "Estimated or actual date the AdverseEvent began, in the opinion of the reporter.", "$ref": "#/definitions/dateTime"}, "_detected": {"description": "Extensions for detected", "$ref": "#/definitions/Element"}, "recordedDate": {"description": "The date on which the existence of the AdverseEvent was first recorded.", "$ref": "#/definitions/dateTime"}, "_recordedDate": {"description": "Extensions for recordedDate", "$ref": "#/definitions/Element"}, "resultingCondition": {"description": "Includes information about the reaction that occurred as a result of exposure to a substance (for example, a drug or a chemical).", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "location": {"description": "The information about where the adverse event occurred.", "$ref": "#/definitions/Reference"}, "seriousness": {"description": "Assessment whether this event was of real importance.", "$ref": "#/definitions/CodeableConcept"}, "severity": {"description": "Describes the severity of the adverse event, in relation to the subject. Contrast to AdverseEvent.seriousness - a severe rash might not be serious, but a mild heart problem is.", "$ref": "#/definitions/CodeableConcept"}, "outcome": {"description": "Describes the type of outcome from the adverse event.", "$ref": "#/definitions/CodeableConcept"}, "recorder": {"description": "Information on who recorded the adverse event.  May be the patient or a practitioner.", "$ref": "#/definitions/Reference"}, "contributor": {"description": "Parties that may or should contribute or have contributed information to the adverse event, which can consist of one or more activities.  Such information includes information leading to the decision to perform the activity and how to perform the activity (e.g. consultant), information that the activity itself seeks to reveal (e.g. informant of clinical history), or information about what activity was performed (e.g. informant witness).", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "suspectEntity": {"description": "Describes the entity that is suspected to have caused the adverse event.", "items": {"$ref": "#/definitions/AdverseEvent_SuspectEntity"}, "type": "array"}, "subjectMedicalHistory": {"description": "AdverseEvent.subjectMedicalHistory.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "referenceDocument": {"description": "AdverseEvent.referenceDocument.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "study": {"description": "AdverseEvent.study.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}}, "additionalProperties": false, "required": ["subject", "resourceType"]}}