{"HealthcareService": {"description": "The details of a healthcare service available at a location.", "properties": {"resourceType": {"description": "This is a HealthcareService resource", "const": "HealthcareService"}, "id": {"description": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.", "$ref": "#/definitions/string"}, "meta": {"description": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content might not always be associated with version changes to the resource.", "$ref": "#/definitions/Meta"}, "implicitRules": {"description": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Often, this is a reference to an implementation guide that defines the special rules along with other profiles etc.", "$ref": "#/definitions/uri"}, "_implicitRules": {"description": "Extensions for implicitRules", "$ref": "#/definitions/Element"}, "language": {"description": "The base language in which the resource is written.", "$ref": "#/definitions/code"}, "_language": {"description": "Extensions for language", "$ref": "#/definitions/Element"}, "text": {"description": "A human-readable narrative that contains a summary of the resource and can be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.", "$ref": "#/definitions/Narrative"}, "contained": {"description": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.", "items": {"$ref": "#/definitions/ResourceList"}, "type": "array"}, "extension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "modifierExtension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource and that modifies the understanding of the element that contains it and/or the understanding of the containing element's descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "identifier": {"description": "External identifiers for this item.", "items": {"$ref": "#/definitions/Identifier"}, "type": "array"}, "active": {"description": "This flag is used to mark the record to not be used. This is not used when a center is closed for maintenance, or for holidays, the notAvailable period is to be used for this.", "$ref": "#/definitions/boolean"}, "_active": {"description": "Extensions for active", "$ref": "#/definitions/Element"}, "providedBy": {"description": "The organization that provides this healthcare service.", "$ref": "#/definitions/Reference"}, "category": {"description": "Identifies the broad category of service being performed or delivered.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "type": {"description": "The specific type of service that may be delivered or performed.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "specialty": {"description": "Collection of specialties handled by the service site. This is more of a medical term.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "location": {"description": "The location(s) where this healthcare service may be provided.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "name": {"description": "Further description of the service as it would be presented to a consumer while searching.", "$ref": "#/definitions/string"}, "_name": {"description": "Extensions for name", "$ref": "#/definitions/Element"}, "comment": {"description": "Any additional description of the service and/or any specific issues not covered by the other attributes, which can be displayed as further detail under the serviceName.", "$ref": "#/definitions/string"}, "_comment": {"description": "Extensions for comment", "$ref": "#/definitions/Element"}, "extraDetails": {"description": "Extra details about the service that can't be placed in the other fields.", "$ref": "#/definitions/markdown"}, "_extraDetails": {"description": "Extensions for extraDetails", "$ref": "#/definitions/Element"}, "photo": {"description": "If there is a photo/symbol associated with this HealthcareService, it may be included here to facilitate quick identification of the service in a list.", "$ref": "#/definitions/Attachment"}, "telecom": {"description": "List of contacts related to this specific healthcare service.", "items": {"$ref": "#/definitions/ContactPoint"}, "type": "array"}, "coverageArea": {"description": "The location(s) that this service is available to (not where the service is provided).", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "serviceProvisionCode": {"description": "The code(s) that detail the conditions under which the healthcare service is available/offered.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "eligibility": {"description": "Does this service have specific eligibility requirements that need to be met in order to use the service?", "items": {"$ref": "#/definitions/HealthcareService_Eligibility"}, "type": "array"}, "program": {"description": "Programs that this service is applicable to.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "characteristic": {"description": "Collection of characteristics (attributes).", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "communication": {"description": "Some services are specifically made available in multiple languages, this property permits a directory to declare the languages this is offered in. Typically this is only provided where a service operates in communities with mixed languages used.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "referralMethod": {"description": "Ways that the service accepts referrals, if this is not provided then it is implied that no referral is required.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "appointmentRequired": {"description": "Indicates whether or not a prospective consumer will require an appointment for a particular service at a site to be provided by the Organization. Indicates if an appointment is required for access to this service.", "$ref": "#/definitions/boolean"}, "_appointmentRequired": {"description": "Extensions for appointmentRequired", "$ref": "#/definitions/Element"}, "availableTime": {"description": "A collection of times that the Service Site is available.", "items": {"$ref": "#/definitions/HealthcareService_AvailableTime"}, "type": "array"}, "notAvailable": {"description": "The HealthcareService is not available during this period of time due to the provided reason.", "items": {"$ref": "#/definitions/HealthcareService_NotAvailable"}, "type": "array"}, "availabilityExceptions": {"description": "A description of site availability exceptions, e.g. public holiday availability. Succinctly describing all possible exceptions to normal site availability as details in the available Times and not available Times.", "$ref": "#/definitions/string"}, "_availabilityExceptions": {"description": "Extensions for availabilityExceptions", "$ref": "#/definitions/Element"}, "endpoint": {"description": "Technical endpoints providing access to services operated for the specific healthcare services defined at this resource.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}}, "additionalProperties": false, "required": ["resourceType"]}}