{"CareTeam": {"description": "The Care Team includes all the people and organizations who plan to participate in the coordination and delivery of care for a patient.", "properties": {"resourceType": {"description": "This is a CareTeam resource", "const": "CareTeam"}, "id": {"description": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.", "$ref": "#/definitions/string"}, "meta": {"description": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content might not always be associated with version changes to the resource.", "$ref": "#/definitions/Meta"}, "implicitRules": {"description": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Often, this is a reference to an implementation guide that defines the special rules along with other profiles etc.", "$ref": "#/definitions/uri"}, "_implicitRules": {"description": "Extensions for implicitRules", "$ref": "#/definitions/Element"}, "language": {"description": "The base language in which the resource is written.", "$ref": "#/definitions/code"}, "_language": {"description": "Extensions for language", "$ref": "#/definitions/Element"}, "text": {"description": "A human-readable narrative that contains a summary of the resource and can be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.", "$ref": "#/definitions/Narrative"}, "contained": {"description": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.", "items": {"$ref": "#/definitions/ResourceList"}, "type": "array"}, "extension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "modifierExtension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource and that modifies the understanding of the element that contains it and/or the understanding of the containing element's descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "identifier": {"description": "Business identifiers assigned to this care team by the performer or other systems which remain constant as the resource is updated and propagates from server to server.", "items": {"$ref": "#/definitions/Identifier"}, "type": "array"}, "status": {"description": "Indicates the current state of the care team.", "$ref": "#/definitions/code"}, "_status": {"description": "Extensions for status", "$ref": "#/definitions/Element"}, "category": {"description": "Identifies what kind of team.  This is to support differentiation between multiple co-existing teams, such as care plan team, episode of care team, longitudinal care team.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "name": {"description": "A label for human use intended to distinguish like teams.  E.g. the \"red\" vs. \"green\" trauma teams.", "$ref": "#/definitions/string"}, "_name": {"description": "Extensions for name", "$ref": "#/definitions/Element"}, "subject": {"description": "Identifies the patient or group whose intended care is handled by the team.", "$ref": "#/definitions/Reference"}, "encounter": {"description": "The Encounter during which this CareTeam was created or to which the creation of this record is tightly associated.", "$ref": "#/definitions/Reference"}, "period": {"description": "Indicates when the team did (or is intended to) come into effect and end.", "$ref": "#/definitions/Period"}, "participant": {"description": "Identifies all people and organizations who are expected to be involved in the care team.", "items": {"$ref": "#/definitions/CareTeam_Participant"}, "type": "array"}, "reasonCode": {"description": "Describes why the care team exists.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "reasonReference": {"description": "Condition(s) that this care team addresses.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "managingOrganization": {"description": "The organization responsible for the care team.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "telecom": {"description": "A central contact detail for the care team (that applies to all members).", "items": {"$ref": "#/definitions/ContactPoint"}, "type": "array"}, "note": {"description": "Comments made about the CareTeam.", "items": {"$ref": "#/definitions/Annotation"}, "type": "array"}}, "additionalProperties": false, "required": ["resourceType"]}}