{"MedicinalProductDefinition": {"description": "A medicinal product, being a substance or combination of substances that is intended to treat, prevent or diagnose a disease, or to restore, correct or modify physiological functions by exerting a pharmacological, immunological or metabolic action. This resource is intended to define and detail such products and their properties, for uses other than direct patient care (e.g. regulatory use, or drug catalogs).", "properties": {"resourceType": {"description": "This is a MedicinalProductDefinition resource", "const": "MedicinalProductDefinition"}, "id": {"description": "The logical id of the resource, as used in the URL for the resource. Once assigned, this value never changes.", "$ref": "#/definitions/string"}, "meta": {"description": "The metadata about the resource. This is content that is maintained by the infrastructure. Changes to the content might not always be associated with version changes to the resource.", "$ref": "#/definitions/Meta"}, "implicitRules": {"description": "A reference to a set of rules that were followed when the resource was constructed, and which must be understood when processing the content. Often, this is a reference to an implementation guide that defines the special rules along with other profiles etc.", "$ref": "#/definitions/uri"}, "_implicitRules": {"description": "Extensions for implicitRules", "$ref": "#/definitions/Element"}, "language": {"description": "The base language in which the resource is written.", "$ref": "#/definitions/code"}, "_language": {"description": "Extensions for language", "$ref": "#/definitions/Element"}, "text": {"description": "A human-readable narrative that contains a summary of the resource and can be used to represent the content of the resource to a human. The narrative need not encode all the structured data, but is required to contain sufficient detail to make it \"clinically safe\" for a human to just read the narrative. Resource definitions may define what content should be represented in the narrative to ensure clinical safety.", "$ref": "#/definitions/Narrative"}, "contained": {"description": "These resources do not have an independent existence apart from the resource that contains them - they cannot be identified independently, and nor can they have their own independent transaction scope.", "items": {"$ref": "#/definitions/ResourceList"}, "type": "array"}, "extension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource. To make the use of extensions safe and manageable, there is a strict set of governance  applied to the definition and use of extensions. Though any implementer can define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension.", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "modifierExtension": {"description": "May be used to represent additional information that is not part of the basic definition of the resource and that modifies the understanding of the element that contains it and/or the understanding of the containing element's descendants. Usually modifier elements provide negation or qualification. To make the use of extensions safe and manageable, there is a strict set of governance applied to the definition and use of extensions. Though any implementer is allowed to define an extension, there is a set of requirements that SHALL be met as part of the definition of the extension. Applications processing a resource are required to check for modifier extensions.\n\nModifier extensions SHALL NOT change the meaning of any elements on Resource or DomainResource (including cannot change the meaning of modifierExtension itself).", "items": {"$ref": "#/definitions/Extension"}, "type": "array"}, "identifier": {"description": "Business identifier for this product. Could be an MPID. When in development or being regulated, products are typically referenced by official identifiers, assigned by a manufacturer or regulator, and unique to a product (which, when compared to a product instance being prescribed, is actually a product type). See also MedicinalProductDefinition.code.", "items": {"$ref": "#/definitions/Identifier"}, "type": "array"}, "type": {"description": "Regulatory type, e.g. Investigational or Authorized.", "$ref": "#/definitions/CodeableConcept"}, "domain": {"description": "If this medicine applies to human or veterinary uses.", "$ref": "#/definitions/CodeableConcept"}, "version": {"description": "A business identifier relating to a specific version of the product, this is commonly used to support revisions to an existing product.", "$ref": "#/definitions/string"}, "_version": {"description": "Extensions for version", "$ref": "#/definitions/Element"}, "status": {"description": "The status within the lifecycle of this product record. A high-level status, this is not intended to duplicate details carried elsewhere such as legal status, or authorization status.", "$ref": "#/definitions/CodeableConcept"}, "statusDate": {"description": "The date at which the given status became applicable.", "$ref": "#/definitions/dateTime"}, "_statusDate": {"description": "Extensions for statusDate", "$ref": "#/definitions/Element"}, "description": {"description": "General description of this product.", "$ref": "#/definitions/markdown"}, "_description": {"description": "Extensions for description", "$ref": "#/definitions/Element"}, "combinedPharmaceuticalDoseForm": {"description": "The dose form for a single part product, or combined form of a multiple part product. This is one concept that describes all the components. It does not represent the form with components physically mixed, if that might be necessary, for which see (AdministrableProductDefinition.administrableDoseForm).", "$ref": "#/definitions/CodeableConcept"}, "route": {"description": "The path by which the product is taken into or makes contact with the body. In some regions this is referred to as the licenced or approved route. See also AdministrableProductDefinition resource. MedicinalProductDefinition.route is the same concept as AdministrableProductDefinition.routeOfAdministration.code, and they cannot be used together.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "indication": {"description": "Description of indication(s) for this product, used when structured indications are not required. In cases where structured indications are required, they are captured using the ClinicalUseDefinition resource. An indication is a medical situation for which using the product is appropriate.", "$ref": "#/definitions/markdown"}, "_indication": {"description": "Extensions for indication", "$ref": "#/definitions/Element"}, "legalStatusOfSupply": {"description": "The legal status of supply of the medicinal product as classified by the regulator.", "$ref": "#/definitions/CodeableConcept"}, "additionalMonitoringIndicator": {"description": "Whether the Medicinal Product is subject to additional monitoring for regulatory reasons, such as heightened reporting requirements.", "$ref": "#/definitions/CodeableConcept"}, "specialMeasures": {"description": "Whether the Medicinal Product is subject to special measures for regulatory reasons, such as a requirement to conduct post-authorisation studies.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "pediatricUseIndicator": {"description": "If authorised for use in children, or infants, neonates etc.", "$ref": "#/definitions/CodeableConcept"}, "classification": {"description": "Allows the product to be classified by various systems, commonly WHO ATC.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "marketingStatus": {"description": "Marketing status of the medicinal product, in contrast to marketing authorization. This refers to the product being actually 'on the market' as opposed to being allowed to be on the market (which is an authorization).", "items": {"$ref": "#/definitions/MarketingStatus"}, "type": "array"}, "packagedMedicinalProduct": {"description": "Package type for the product. See also the PackagedProductDefinition resource.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "ingredient": {"description": "The ingredients of this medicinal product - when not detailed in other resources. This is only needed if the ingredients are not specified by incoming references from the Ingredient resource, or indirectly via incoming AdministrableProductDefinition, PackagedProductDefinition or ManufacturedItemDefinition references. In cases where those levels of detail are not used, the ingredients may be specified directly here as codes.", "items": {"$ref": "#/definitions/CodeableConcept"}, "type": "array"}, "impurity": {"description": "Any component of the drug product which is not the chemical entity defined as the drug substance, or an excipient in the drug product. This includes process-related impurities and contaminants, product-related impurities including degradation products.", "items": {"$ref": "#/definitions/CodeableReference"}, "type": "array"}, "attachedDocument": {"description": "Additional information or supporting documentation about the medicinal product.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "masterFile": {"description": "A master file for the medicinal product (e.g. Pharmacovigilance System Master File). Drug master files (DMFs) are documents submitted to regulatory agencies to provide confidential detailed information about facilities, processes or articles used in the manufacturing, processing, packaging and storing of drug products.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "contact": {"description": "A product specific contact, person (in a role), or an organization.", "items": {"$ref": "#/definitions/MedicinalProductDefinition_Contact"}, "type": "array"}, "clinicalTrial": {"description": "Clinical trials or studies that this product is involved in.", "items": {"$ref": "#/definitions/Reference"}, "type": "array"}, "code": {"description": "A code that this product is known by, usually within some formal terminology, perhaps assigned by a third party (i.e. not the manufacturer or regulator). Products (types of medications) tend to be known by identifiers during development and within regulatory process. However when they are prescribed they tend to be identified by codes. The same product may be have multiple codes, applied to it by multiple organizations.", "items": {"$ref": "#/definitions/Coding"}, "type": "array"}, "name": {"description": "The product's name, including full name and possibly coded parts.", "items": {"$ref": "#/definitions/MedicinalProductDefinition_Name"}, "type": "array"}, "crossReference": {"description": "Reference to another product, e.g. for linking authorised to investigational product, or a virtual product.", "items": {"$ref": "#/definitions/MedicinalProductDefinition_CrossReference"}, "type": "array"}, "operation": {"description": "A manufacturing or administrative process or step associated with (or performed on) the medicinal product.", "items": {"$ref": "#/definitions/MedicinalProductDefinition_Operation"}, "type": "array"}, "characteristic": {"description": "Allows the key product features to be recorded, such as \"sugar free\", \"modified release\", \"parallel import\".", "items": {"$ref": "#/definitions/MedicinalProductDefinition_Characteristic"}, "type": "array"}}, "additionalProperties": false, "required": ["name", "resourceType"]}}